In [39]:
import pandas as pd 
import numpy as np

In [44]:
df = pd.read_csv('../data/schoolSchema.csv')

In [45]:
df.shape
#df.drop('Unnamed: 0',axis=1,inplace=True)

(3787, 5)

In [46]:
df.head()

,title,tuition,location,image,rating
0,Alabama A & M University,10024.0,Normal AL 35762,NaN,0
1,University of Alabama at Birmingham,8568.0,Birmingham AL 35294-0110,NaN,0
2,University of Alabama in Huntsville,11488.0,Huntsville AL 35899,NaN,0
3,Alabama State University,11068.0,Montgomery AL 36104-0271,NaN,0
4,The University of Alabama,11620.0,Tuscaloosa AL 35487-0100,NaN,0

In [47]:
#Now fill with images that are == NaN that we have in our names.csv
imageDF = pd.read_csv('../image/names.csv')

In [48]:
merged_df = pd.merge(df, imageDF, on='title', how='left')
#left join to keep our current schema

merged_df['image_x'] = merged_df['image_y']

merged_df.drop('image_y',axis=1,inplace=True)

merged_df = merged_df.rename(columns={'image_x': 'image'})

In [49]:
merged_df.shape

(3787, 5)

In [50]:
merged_df.head()

,title,tuition,location,image,rating
0,Alabama A & M University,10024.0,Normal AL 35762,NaN,0
1,University of Alabama at Birmingham,8568.0,Birmingham AL 35294-0110,NaN,0
2,University of Alabama in Huntsville,11488.0,Huntsville AL 35899,NaN,0
3,Alabama State University,11068.0,Montgomery AL 36104-0271,NaN,0
4,The University of Alabama,11620.0,Tuscaloosa AL 35487-0100,NaN,0

In [53]:
merged_df.to_json('../data/schoolSchema.json',index=False,orient='records')
merged_df.to_csv('../data/schoolSchema.csv',index=False)

In [54]:
merged_df['title'][0]

,title,tuition,location,image,rating
0,Alabama A & M University,10024.0,Normal AL 35762,NaN,0
1,University of Alabama at Birmingham,8568.0,Birmingham AL 35294-0110,NaN,0
2,University of Alabama in Huntsville,11488.0,Huntsville AL 35899,NaN,0
3,Alabama State University,11068.0,Montgomery AL 36104-0271,NaN,0
4,The University of Alabama,11620.0,Tuscaloosa AL 35487-0100,NaN,0